// 連想配列で作る
Map<String,dynamic> animal1= {
  'image': 'https://x.gd/3rg9B',
  'name':'シベリアン・ハスキー',
  'info':'団体でそりを引く作業犬だったこともあり、複数で飼育すると個性が出て、それぞれの中で暗黙の役割分担ができたりするので、興味がつきません。もちろん単独飼育でも、心を許した飼い主には、実に陽気で人なつこくて従順です。もともとがなんとかなるさといった楽天的な性格なので、苦しいことやつらい現実には目をそらして、早く忘れてしまおうとするところがあります。そのため、訓練やしつけにはかなりてこずります。「迷子になると家に帰れないほど頭が悪い」などと言われますが、実はそうではなく、苦労して家に帰るよりも、居心地のいい所を見つけて「ここもなかなかいいな」と、居候を決め込んで住み着いてしまうためで、これも執着心のない楽天的な性格の表れのようです。',
  'type':'イヌ - 大型',
  'from':'アメリカ',
  'height':'54～60cm',
};
Map<String,dynamic> animal2= {
  'image': 'https://x.gd/VcGAa',
  'name': 'アラスカン・マラミュート',
  'info': 'オオカミを連想させる精悍な容姿に似合わず、平和主義で物静かな愛情溢れる従順な犬です。人が大好きで、特に一度信頼した主人には、ひたすら献身的に尽くします。とても忍耐強いので、子どもの遊び相手もできますし、また長時間の留守番にもじっとがまんして耐えてくれます。でも実はとても甘えん坊なので、帰って来たらめいっぱいほめてあげましょう。感情表現がとても豊かです。',
  'type':'イヌ - 大型',
  'from':'アメリカ（アラスカ地方）',
  'height':'58～71cm',
};
late List<Map<String,dynamic>> animals= [animal1,animal2];
